Repository: WhoisJulie007/AppRentameYA
Catalog: AppRentameYA/*.lproj/Localizable.strings
Languages: es, ja

# welcome_subtitle
source: Rent a car and start earning today.
es: Renta un auto y empieza a ganar hoy.
ja: 車をレンタルして今日から稼ぎ始めましょう。

# inicio
source: Home
es: Inicio
ja: ホーム

# vehiculos
source: Vehicles
es: Vehículos
ja: 車両

# perfil
source: Profile
es: Perfil
ja: プロフィール

source: Hello, Driver!
es: ¡Hola, Conductor!
ja: こんにちは、ドライバー！

# welcome_message
source: Welcome to your control center. Here you can see your vehicle status and find your next car to keep earning.
es: Bienvenido a tu centro de control. Aquí podrás ver el estado de tu vehículo y encontrar tu próximo auto para seguir ganando.
ja: コントロールセンターへようこそ。ここでは、車両の状態を確認し、次の車を見つけて収益を続けることができます。

source: My Applications
es: Mis Solicitudes
ja: 私の申請

# no_applications
source: You have no applications
es: No tienes solicitudes
ja: 申請がありません

source: Ready to start?
es: ¿Listo para empezar?
ja: 始める準備はできましたか？

# ready_to_start_message
source: Navigate to the "Vehicles" section to see the cars we have available for you.
es: Navega a la sección de "Vehículos" para ver los autos que tenemos disponibles para ti.
ja: 「車両」セクションに移動して、利用可能な車を確認してください。

source: Our Benefits
es: Nuestros Beneficios
ja: 私たちのメリット

# benefit_1
source: Comprehensive insurance included.
es: Seguro de cobertura amplia incluido.
ja: 包括的な保険が含まれています。

# benefit_2
source: Preventive maintenance covered.
es: Mantenimientos preventivos cubiertos.
ja: 予防メンテナンスがカバーされています。

# benefit_3
source: Cars ready for platforms (Uber/DiDi).
es: Autos listos para plataformas (Uber/DiDi).
ja: プラットフォーム（Uber/DiDi）対応の車。

source: My Profile
es: Mi Perfil
ja: マイプロフィール

source: User
es: Usuario
ja: ユーザー

source: Administrator
es: Administrador
ja: 管理者

source: Review Applications
es: Revisar Solicitudes
ja: 申請を確認

source: Add Vehicle
es: Agregar Vehículo
ja: 車両を追加

source: Sign Out
es: Cerrar Sesión
ja: サインアウト

source: Apply for %@
es: Aplicar para %@
ja: %@に申請

# complete_data
source: Complete your information. An advisor will contact you shortly.
es: Completa tus datos. Un asesor te contactará a la brevedad.
ja: 情報を入力してください。アドバイザーがすぐに連絡いたします。

source: Full name
es: Nombre completo
ja: 氏名

# name_placeholder
source: Your first and last name
es: Tu nombre y apellido
ja: お名前と名字

# phone_contact
source: Contact phone
es: Teléfono de contacto
ja: 連絡先電話番号

# phone_placeholder
source: 10 digits
es: 10 dígitos
ja: 10桁

# phone_digits
source: Phone must have exactly 10 digits (you have %d)
es: El teléfono debe tener exactamente 10 dígitos (tienes %d)
ja: 電話番号は正確に10桁である必要があります（現在%d桁）

# driver_license
source: Driver's license (front)
es: Licencia de conducir (frente)
ja: 運転免許証（表面）

# deposit_banner
source: A deposit of $3,500 MXN is required when signing the contract.
es: Se requiere un depósito de $3,500 MXN al firmar el contrato.
ja: 契約時に3,500 MXNの保証金が必要です。

# deposit_title
source: Security deposit:
es: Depósito en garantía:
ja: 保証金：

# terms_agreement
source: I agree that my personal data (name, phone and license image) will be used for the evaluation process of my vehicle rental application and to contact me regarding this application.
es: Estoy de acuerdo en que mis datos personales (nombre, teléfono e imagen de licencia) sean utilizados para el proceso de evaluación de mi solicitud de renta de vehículo y para contactarme respecto a esta solicitud.
ja: 私の個人データ（名前、電話番号、免許証の画像）が、車両レンタル申請の評価プロセスと、この申請に関する連絡に使用されることに同意します。

# must_accept_terms
source: You must accept the terms to continue
es: Debes aceptar los términos para continuar
ja: 続行するには条件を承認する必要があります

source: Send Application
es: Enviar Aplicación
ja: 申請を送信

source: Sending...
es: Enviando...
ja: 送信中...

# already_has_application
source: You already have a pending or approved application for this vehicle.
es: Ya tienes una solicitud pendiente o aprobada para este vehículo.
ja: この車両に対して保留中または承認済みの申請が既にあります。

# can_apply_other_vehicles
source: You can apply to other different vehicles.
es: Puedes aplicar a otros vehículos diferentes.
ja: 他の異なる車両に申請できます。

source: Pending
es: Pendiente
ja: 保留中

source: In Review
es: En Revisión
ja: 審査中

source: Approved
es: Aprobada
ja: 承認済み

source: Rejected
es: Rechazada
ja: 却下

source: Application Sent!
es: ¡Solicitud Enviada!
ja: 申請が送信されました！

# application_sent_message
source: We have received your information. We will contact you soon for the next steps.
es: Hemos recibido tus datos. Pronto nos pondremos en contacto contigo para los siguientes pasos.
ja: 情報を受け取りました。次のステップについてすぐにご連絡いたします。

source: Back to Vehicles
es: Volver a Vehículos
ja: 車両に戻る

source: Rental Applications
es: Solicitudes de Renta
ja: レンタル申請

# no_applications_found
source: No applications
es: No hay solicitudes
ja: 申請がありません

source: Loading applications...
es: Cargando solicitudes...
ja: 申請を読み込み中...

source: Approve
es: Aprobar
ja: 承認

source: Reject
es: Rechazar
ja: 却下

source: View License
es: Ver Licencia
ja: 免許証を表示

source: Vehicle
es: Vehículo
ja: 車両

source: Add New Vehicle
es: Agregar Nuevo Vehículo
ja: 新しい車両を追加

source: Vehicle name
es: Nombre del vehículo
ja: 車両名

# vehicle_name_placeholder
source: Ex: Nissan Versa
es: Ej: Nissan Versa
ja: 例：日産ヴェルサ

# price_per_week
source: Price per week (MXN)
es: Precio por semana (MXN)
ja: 週間料金（MXN）

# price_placeholder
source: Ex: 2100
es: Ej: 2100
ja: 例：2100

source: Characteristics
es: Características
ja: 特徴

# add_characteristic_hint
source: Add one characteristic at a time and press Enter
es: Agrega una característica a la vez y presiona Enter
ja: 一度に1つの特徴を追加し、Enterキーを押してください

# characteristic_placeholder
source: Ex: Automatic
es: Ej: Automático
ja: 例：オートマチック

source: Save Vehicle
es: Guardar Vehículo
ja: 車両を保存

source: Saving...
es: Guardando...
ja: 保存中...

source: week
es: semana
ja: 週

source: Apply now
es: Aplicar ahora
ja: 今すぐ申請

source: Error
ja: エラー

source: Close
es: Cerrar
ja: 閉じる

# please_upload_license
source: Please upload a photo of your license
es: Por favor, sube una foto de tu licencia
ja: 免許証の写真をアップロードしてください

source: Error saving vehicle: %@
es: Error al guardar el vehículo: %@
ja: 車両の保存エラー: %@

# only_admins_can_add_vehicles
source: Only administrators can add vehicles
es: Solo los administradores pueden agregar vehículos
ja: 管理者のみが車両を追加できます

# price_must_be_valid
source: Price must be a valid number
es: El precio debe ser un número válido
ja: 価格は有効な数値である必要があります

source: Unauthorized user
es: Usuario no autenticado
ja: 認証されていないユーザー

source: Error converting image
es: Error al convertir imagen
ja: 画像の変換エラー

# error_uploading_image
source: Error uploading image: %@. Verify that Storage is enabled and security rules are configured correctly.
es: Error al subir la imagen: %@. Verifica que Storage esté habilitado y las reglas de seguridad estén configuradas correctamente.
ja: 画像のアップロードエラー: %@。Storageが有効になっていることと、セキュリティルールが正しく設定されていることを確認してください。
